Revit 2027 API
Document.NewSpace(Phase) Method
 Creates a new unplaced space on a given phase.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Space NewSpace(
	Phase phase
)
Public Function NewSpace (
	phase As Phase
) As Space
public:
Space^ NewSpace(
	Phase^ phase
)
member NewSpace :
        phase : Phase -> Space
Parameters
phase Phase
 The phase in which the space is to exist.
Return Value
Space
 If successful the new space should be returned, otherwise null.
Exceptions
Exception | Condition
ArgumentException | Thrown if the phase does not exist in the given document.
See Also
Reference
Document Class
NewSpace Overload
Autodesk.Revit.Creation Namespace